"""# 딕셔너리의 이해
dc={
  '코카콜라':900,
  '바나나맛우유':750,
  '비타500':600,
  '삼다수':450
}
#print(dc)

dc2={
  '이름':'이순동',
  '나이':19,
  '직업':'학생',
  '키':175.8
}
#print(dc2)
#딕셔너리: 키는 중복될 수 없다. 


dc3={
  '이순동':22,
  '정순동':22,
  '김순동':22
}
#print(dc3)
dc4={
  '동':22,
  '동':22,
  '동':22
}
#print(dc4)

v=dc['삼다수']
#print(v)
#키는 수정 불가 value는 가능 
dc['삼다수']=550
#print(dc)
#없으면 추가
dc['카페라떼']=1300
#print(dc)

del dc['비타500']
#print(dc)

t1=[1,2,3]
t2=[1,2,3]
t3=[3,2,1]
print(t1==t2,t1==t3)
#리스트 수,종류,순서 다 같아야 함
#딕셔너리는 저장순서를 유지하지 않는다.

d1={1: 'a',2: 'b'}
d2={1: 'a',2:'b'}
d3={2:'b',1:'a'}
print(d1==d2,d1==d3)

if '새우깡' in dc:
  dc2['새우깡']=950 # 수정 

if '카페라떼' not in dc:
  dc1['카페라떼']=1200 # 추가 

print(dc) """

dc={'새우깡':700,'콘치즈':850,'꼬깔콘':750}
for i in dc:
  print(i,end=' ')

print("\n")
for i in dc:
  dc[i]+=70

print(dc)